app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    @games = Game.all

INSERT INTO "games" ("round", "team", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["round", 1], ["team", "Blue"], ["score", 1], ["created_at", 2016-08-17 13:04:01 UTC], ["updated_at", 2016-08-17 13:04:01 UTC]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_game
      @game = Game.find(params[:id])